Revit 2024 API
ExternalServices.BuiltInExternalServices.CustomFieldEditPropertiesService Property
 Autodesk Internal: The service for editing properties of a custom field.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId CustomFieldEditPropertiesService { get; }
Visual Basic
Public Shared ReadOnly Property CustomFieldEditPropertiesService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ CustomFieldEditPropertiesService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace